## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/1e69f5ce-5a30-4e06-a246-4a902cba5caa/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "aks" {
        id                                  = "/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerService/managedClusters/freundcloudaks"
        name                                = "freundcloudaks"
        tags                                = {
            "application" = "freundcloudaks"
            "environment" = "dev"
            "owner"       = "olafkfreund"
        }
        # (40 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "default"
            tags                          = {}
            # (33 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (7 unchanged blocks hidden)
    }

  # module.grafana_admin_role.azurerm_role_assignment.role will be created
  + resource "azurerm_role_assignment" "role" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Grafana Admin"
      + scope                            = "/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Dashboard/grafana/dev-grafana-fcaks"
      + skip_service_principal_aad_check = (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # module.aks.azurerm_kubernetes_cluster.aks will be updated in-place%0A  ~ resource "azurerm_kubernetes_cluster" "aks" {%0A        id                                  = "/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.ContainerService/managedClusters/freundcloudaks"%0A        name                                = "freundcloudaks"%0A        tags                                = {%0A            "application" = "freundcloudaks"%0A            "environment" = "dev"%0A            "owner"       = "olafkfreund"%0A        }%0A        # (40 unchanged attributes hidden)%0A%0A      ~ default_node_pool {%0A            name                          = "default"%0A            tags                          = {}%0A            # (33 unchanged attributes hidden)%0A%0A          - upgrade_settings {%0A              - drain_timeout_in_minutes      = 0 -> null%0A              - max_surge                     = "10%25" -> null%0A              - node_soak_duration_in_minutes = 0 -> null%0A            }%0A        }%0A%0A        # (7 unchanged blocks hidden)%0A    }%0A%0A  # module.grafana_admin_role.azurerm_role_assignment.role will be created%0A  + resource "azurerm_role_assignment" "role" {%0A      + id                               = (known after apply)%0A      + name                             = (known after apply)%0A      + principal_type                   = "User"%0A      + role_definition_id               = (known after apply)%0A      + role_definition_name             = "Grafana Admin"%0A      + scope                            = "/subscriptions/46b2dfbe-fe9e-4433-b327-b2dc32c8af5e/resourceGroups/rg-freundcloudaks/providers/Microsoft.Dashboard/grafana/dev-grafana-fcaks"%0A      + skip_service_principal_aad_check = (known after apply)%0A        # (1 unchanged attribute hidden)%0A    }%0A%0APlan: 1 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>